       02 client-id PIC X(10).
       02 account-number PIC X(10).
       02 account-type PIC X(20).
       02 balance PIC ZZZZZZ9V99.
       02 valuta-code PIC X(3).
       